# Lab 5: SQLite3 SQL statements

## SQL Quiz -1 Examples
- select
- where
- group by 
- order By 
- having

In [1]:
# ex1 

SQLite3Command = ".mode column\n"

SQLstr = """
SELECT * 
FROM emp;
"""
sqlfile = open("temp.sql", "w")
sqlfile.write(SQLite3Command + SQLstr)
sqlfile.close()

!sqlite3 mydatabase.db <temp.sql

EMPNO  ENAME   JOB        MGR   HIREDATE    SAL   COMM  DEPTNO
-----  ------  ---------  ----  ----------  ----  ----  ------
7369   SMITH   CLERK      7902  1980-12-17  800         20
7499   ALLEN   SALESMAN   7698  1981-02-20  1600  300   30
7521   WARD    SALESMAN   7698  1981-02-22  1250  500   30
7566   JONES   MANAGER    7839  1981-04-02  2975        20
7654   MARTIN  SALESMAN   7698  1981-09-28  1250  1400  30
7698   BLAKE   MANAGER    7839  1981-05-01  2850        30
7782   CLARK   MANAGER    7839  1981-06-09  2450        10
7788   SCOTT   ANALYST    7566  1982-12-09  3000        20
7839   KING    PRESIDENT        1981-11-17  5000        10
7844   TURNER  SALESMAN   7698  1981-09-08  1500  0     30
7876   ADAMS   CLERK      7788  1983-01-11  1100        20
7900   JAMES   CLERK      7698  1981-12-03  950         30
7902   FORD    ANALYST    7566  1981-12-13  3000        20
7934   MILLER  CLERK      7782  1982-01-23  1300        10

In [2]:
# ex2 

SQLite3Command = ".mode column\n"

SQLstr = """
SELECT ename, sal 
FROM emp
WHERE sal>2000
"""
sqlfile = open("temp.sql", "w")
sqlfile.write(SQLite3Command + SQLstr)
sqlfile.close()

!sqlite3 mydatabase.db <temp.sql

ENAME  SAL
-----  ----
JONES  2975
BLAKE  2850
CLARK  2450
SCOTT  3000
KING   5000
FORD   3000

In [4]:
# ex3 

SQLite3Command = ".mode column\n"

SQLstr = """
SELECT ename, sal 
FROM emp
WHERE sal>2000
ORDER BY sal DESC;
"""
sqlfile = open("temp.sql", "w")
sqlfile.write(SQLite3Command + SQLstr)
sqlfile.close()

!sqlite3 mydatabase.db <temp.sql

ENAME  SAL
-----  ----
KING   5000
SCOTT  3000
FORD   3000
JONES  2975
BLAKE  2850
CLARK  2450

In [9]:
# ex4 

SQLite3Command = ".mode column\n"

SQLstr = """
SELECT deptno, COUNT(ename) AS "Number of Employee" , SUM(sal) AS "Total SAL"
FROM emp
WHERE sal>1000
GROUP BY deptno
ORDER BY "Total SAL" DESC;

"""
sqlfile = open("temp.sql", "w")
sqlfile.write(SQLite3Command + SQLstr)
sqlfile.close()

!sqlite3 mydatabase.db <temp.sql

DEPTNO  Number of Employee  Total SAL
------  ------------------  ---------
20      4                   10075
10      3                   8750
30      5                   8450

In [10]:
# ex5 

SQLite3Command = ".mode column\n"

SQLstr = """
SELECT deptno, COUNT(ename) AS "Number of Employee" , SUM(sal) AS "Total SAL"
FROM emp
WHERE sal>1000
GROUP BY deptno
HAVING "Number of Employee" >3
ORDER BY "Total SAL" DESC;

"""
sqlfile = open("temp.sql", "w")
sqlfile.write(SQLite3Command + SQLstr)
sqlfile.close()

!sqlite3 mydatabase.db <temp.sql

DEPTNO  Number of Employee  Total SAL
------  ------------------  ---------
20      4                   10075
30      5                   8450

In [15]:
# ex6 

SQLite3Command = ".mode column\n"

SQLstr = """
SELECT deptno, ename , sal
FROM emp
WHERE ename LIKE "__A%"

"""
sqlfile = open("temp.sql", "w")
sqlfile.write(SQLite3Command + SQLstr)
sqlfile.close()

!sqlite3 mydatabase.db <temp.sql

DEPTNO  ENAME  SAL
------  -----  ----
30      BLAKE  2850
10      CLARK  2450
20      ADAMS  1100

## SQL Quiz 2 Examples
- Join 
- Subqueries

In [22]:
# ex0 

SQLite3Command = ".mode column\n"

SQLstr = """
SELECT *
FROM emp;

"""
sqlfile = open("temp.sql", "w")
sqlfile.write(SQLite3Command + SQLstr)
sqlfile.close()

!sqlite3 mydatabase.db <temp.sql

EMPNO  ENAME   JOB        MGR   HIREDATE    SAL   COMM  DEPTNO
-----  ------  ---------  ----  ----------  ----  ----  ------
7369   SMITH   CLERK      7902  1980-12-17  800         20
7499   ALLEN   SALESMAN   7698  1981-02-20  1600  300   30
7521   WARD    SALESMAN   7698  1981-02-22  1250  500   30
7566   JONES   MANAGER    7839  1981-04-02  2975        20
7654   MARTIN  SALESMAN   7698  1981-09-28  1250  1400  30
7698   BLAKE   MANAGER    7839  1981-05-01  2850        30
7782   CLARK   MANAGER    7839  1981-06-09  2450        10
7788   SCOTT   ANALYST    7566  1982-12-09  3000        20
7839   KING    PRESIDENT        1981-11-17  5000        10
7844   TURNER  SALESMAN   7698  1981-09-08  1500  0     30
7876   ADAMS   CLERK      7788  1983-01-11  1100        20
7900   JAMES   CLERK      7698  1981-12-03  950         30
7902   FORD    ANALYST    7566  1981-12-13  3000        20
7934   MILLER  CLERK      7782  1982-01-23  1300        10

In [23]:
# ex0 

SQLite3Command = ".mode column\n"

SQLstr = """
SELECT *
FROM dept;

"""
sqlfile = open("temp.sql", "w")
sqlfile.write(SQLite3Command + SQLstr)
sqlfile.close()

!sqlite3 mydatabase.db <temp.sql

DEPTNO  DNAME       LOC
------  ----------  --------
10      ACCOUNTING  NEW YORK
20      RESEARCH    DALLAS
30      SALES       CHICAGO
40      OPERATIONS  BOSTON

In [26]:
# ex1a inner join (implicit)

SQLite3Command = ".mode column\n"

SQLstr = """
SELECT ename,dname
FROM emp,dept
WHERE emp.deptno=dept.deptno

"""
sqlfile = open("temp.sql", "w")
sqlfile.write(SQLite3Command + SQLstr)
sqlfile.close()

!sqlite3 mydatabase.db <temp.sql

ENAME   DNAME
------  ----------
SMITH   RESEARCH
ALLEN   SALES
WARD    SALES
JONES   RESEARCH
MARTIN  SALES
BLAKE   SALES
CLARK   ACCOUNTING
SCOTT   RESEARCH
KING    ACCOUNTING
TURNER  SALES
ADAMS   RESEARCH
JAMES   SALES
FORD    RESEARCH
MILLER  ACCOUNTING

In [27]:
# ex1b inner join (explicit )

SQLite3Command = ".mode column\n"

SQLstr = """
SELECT ename,dname
FROM emp INNER JOIN dept
ON emp.deptno=dept.deptno

"""
sqlfile = open("temp.sql", "w")
sqlfile.write(SQLite3Command + SQLstr)
sqlfile.close()

!sqlite3 mydatabase.db <temp.sql

ENAME   DNAME
------  ----------
SMITH   RESEARCH
ALLEN   SALES
WARD    SALES
JONES   RESEARCH
MARTIN  SALES
BLAKE   SALES
CLARK   ACCOUNTING
SCOTT   RESEARCH
KING    ACCOUNTING
TURNER  SALES
ADAMS   RESEARCH
JAMES   SALES
FORD    RESEARCH
MILLER  ACCOUNTING

In [28]:
# ex2 outter join (explicit )

SQLite3Command = ".mode column\n"

SQLstr = """
SELECT ename,dname
FROM dept LEFT JOIN emp
ON emp.deptno=dept.deptno

"""
sqlfile = open("temp.sql", "w")
sqlfile.write(SQLite3Command + SQLstr)
sqlfile.close()

!sqlite3 mydatabase.db <temp.sql

ENAME   DNAME
------  ----------
CLARK   ACCOUNTING
KING    ACCOUNTING
MILLER  ACCOUNTING
ADAMS   RESEARCH
FORD    RESEARCH
JONES   RESEARCH
SCOTT   RESEARCH
SMITH   RESEARCH
ALLEN   SALES
BLAKE   SALES
JAMES   SALES
MARTIN  SALES
TURNER  SALES
WARD    SALES
        OPERATIONS

In [29]:
# ex3 self join (explicit )

SQLite3Command = ".mode column\n"

SQLstr = """
SELECT E.ename,M.ename
FROM emp E INNER JOIN emp M 
ON E.mgr=M.empno

"""
sqlfile = open("temp.sql", "w")
sqlfile.write(SQLite3Command + SQLstr)
sqlfile.close()

!sqlite3 mydatabase.db <temp.sql

ENAME   ENAME
------  -----
SMITH   FORD
ALLEN   BLAKE
WARD    BLAKE
JONES   KING
MARTIN  BLAKE
BLAKE   KING
CLARK   KING
SCOTT   JONES
TURNER  BLAKE
ADAMS   SCOTT
JAMES   BLAKE
FORD    JONES
MILLER  CLARK

In [32]:
# ex4 SUB Query

SQLite3Command = ".mode column\n"

SQLstr = """
SELECT ename
FROM emp 
WHERE sal=(SELECT max(sal)
           FROM emp)
;
"""
sqlfile = open("temp.sql", "w")
sqlfile.write(SQLite3Command + SQLstr)
sqlfile.close()

!sqlite3 mydatabase.db <temp.sql

ENAME
-----
KING

In [38]:
# ex5 SUB Query

SQLite3Command = ".mode column\n"

SQLstr = """
SELECT dname
FROM dept
WHERE deptno IN (SELECT deptno
FROM emp
WHERE job="CLERK")
;
"""
sqlfile = open("temp.sql", "w")
sqlfile.write(SQLite3Command + SQLstr)
sqlfile.close()

!sqlite3 mydatabase.db <temp.sql

DNAME
----------
ACCOUNTING
RESEARCH
SALES

In [39]:
# This line is a shell command to execute an SQL query using SQLite3 on a database named 'mydatabase.db'.
# The query is read from a file named 'ex1.sql'.
!sqlite3 mydatabase.db <ex1.sql

DNAME
----------
ACCOUNTING
RESEARCH
SALES